benchmarks/specs_CephClient1.txt
================================================================================
  Ceph Node Specification & Benchmark Report
  Generated : 2026-02-27T09:53:57Z
  Host      : CephClient1  (CephClient1)
  User      : root (uid=0)
  Log file  : specs_CephClient1_20260227T095357Z.txt
================================================================================

================================================================================
  SECTION : 0  DEPENDENCY BOOTSTRAP
  TIME    : 2026-02-27T09:53:57Z
================================================================================


================================================================================
  SECTION : 1  NODE IDENTIFICATION
  TIME    : 2026-02-27T09:54:09Z
================================================================================


--------------------------------------------------------------------------------
  TASK  : Timestamp (UTC)
  CMD   : date -u +%Y-%m-%dT%H:%M:%SZ
  START : 2026-02-27T09:54:09Z
--------------------------------------------------------------------------------
2026-02-27T09:54:09Z
--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:09Z  |  EXIT: 0
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
  TASK  : hostnamectl
  CMD   : hostnamectl
  START : 2026-02-27T09:54:09Z
--------------------------------------------------------------------------------
   Static hostname: CephClient1
         Icon name: computer-vm
           Chassis: vm
        Machine ID: b21ed302c2054ef3a1721c79a9486100
           Boot ID: 1ca703a002ee4ffca795ac63b0f7f99c
    Virtualization: kvm
  Operating System: Debian GNU/Linux 11 (bullseye)
            Kernel: Linux 5.10.0-32-amd64
      Architecture: x86-64
--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:09Z  |  EXIT: 0
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
  TASK  : FQDN
  CMD   : hostname -f
  START : 2026-02-27T09:54:09Z
--------------------------------------------------------------------------------
CephClient1
--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:09Z  |  EXIT: 0
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
  TASK  : Machine ID
  CMD   : cat /etc/machine-id
  START : 2026-02-27T09:54:09Z
--------------------------------------------------------------------------------
b21ed302c2054ef3a1721c79a9486100
--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:09Z  |  EXIT: 0
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
  TASK  : Kernel / uname
  CMD   : uname -a
  START : 2026-02-27T09:54:09Z
--------------------------------------------------------------------------------
Linux CephClient1 5.10.0-32-amd64 #1 SMP Debian 5.10.223-1 (2024-08-10) x86_64 GNU/Linux
--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:09Z  |  EXIT: 0
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
  TASK  : Uptime
  CMD   : uptime
  START : 2026-02-27T09:54:09Z
--------------------------------------------------------------------------------
 10:54:09 up 209 days, 20:10,  1 user,  load average: 0.16, 0.10, 0.03
--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:09Z  |  EXIT: 0
--------------------------------------------------------------------------------

================================================================================
  SECTION : 2  SYSTEM  (MANUFACTURER / MODEL / SERIAL)
  TIME    : 2026-02-27T09:54:09Z
================================================================================


--------------------------------------------------------------------------------
  TASK  : DMI – System
  CMD   : dmidecode -t system
  START : 2026-02-27T09:54:09Z
--------------------------------------------------------------------------------
# dmidecode 3.3
Getting SMBIOS data from sysfs.
SMBIOS 2.8 present.

Handle 0x0100, DMI type 1, 27 bytes
System Information
	Manufacturer: Hetzner
	Product Name: vServer
	Version: 20171111
	Serial Number: 30390427
	UUID: b21ed302-c205-4ef3-a172-1c79a9486100
	Wake-up Type: Power Switch
	SKU Number: TM
	Family: Hetzner_vServer

Handle 0x2000, DMI type 32, 11 bytes
System Boot Information
	Status: No errors detected

--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:09Z  |  EXIT: 0
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
  TASK  : DMI – BIOS
  CMD   : dmidecode -t bios
  START : 2026-02-27T09:54:09Z
--------------------------------------------------------------------------------
# dmidecode 3.3
Getting SMBIOS data from sysfs.
SMBIOS 2.8 present.

Handle 0x0000, DMI type 0, 24 bytes
BIOS Information
	Vendor: Hetzner
	Version: 20171111
	Release Date: 11/11/2017
	Address: 0xE8000
	Runtime Size: 96 kB
	ROM Size: 64 kB
	Characteristics:
		BIOS characteristics not supported
		Targeted content distribution is supported
		System is a virtual machine
	BIOS Revision: 1.0

--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:09Z  |  EXIT: 0
--------------------------------------------------------------------------------

================================================================================
  SECTION : 3  CPU
  TIME    : 2026-02-27T09:54:09Z
================================================================================


--------------------------------------------------------------------------------
  TASK  : lscpu
  CMD   : lscpu
  START : 2026-02-27T09:54:09Z
--------------------------------------------------------------------------------
Architecture:                         x86_64
CPU op-mode(s):                       32-bit, 64-bit
Byte Order:                           Little Endian
Address sizes:                        40 bits physical, 48 bits virtual
CPU(s):                               4
On-line CPU(s) list:                  0-3
Thread(s) per core:                   1
Core(s) per socket:                   4
Socket(s):                            1
NUMA node(s):                         1
Vendor ID:                            AuthenticAMD
CPU family:                           23
Model:                                49
Model name:                           AMD EPYC-Rome Processor
Stepping:                             0
CPU MHz:                              2399.998
BogoMIPS:                             4799.99
Hypervisor vendor:                    KVM
Virtualization type:                  full
L1d cache:                            128 KiB
L1i cache:                            128 KiB
L2 cache:                             2 MiB
L3 cache:                             16 MiB
NUMA node0 CPU(s):                    0-3
Vulnerability Gather data sampling:   Not affected
Vulnerability Itlb multihit:          Not affected
Vulnerability L1tf:                   Not affected
Vulnerability Mds:                    Not affected
Vulnerability Meltdown:               Not affected
Vulnerability Mmio stale data:        Not affected
Vulnerability Reg file data sampling: Not affected
Vulnerability Retbleed:               Mitigation; untrained return thunk; SMT disabled
Vulnerability Spec rstack overflow:   Mitigation; SMT disabled
Vulnerability Spec store bypass:      Mitigation; Speculative Store Bypass disabled via prctl and seccomp
Vulnerability Spectre v1:             Mitigation; usercopy/swapgs barriers and __user pointer sanitization
Vulnerability Spectre v2:             Mitigation; Retpolines, IBPB conditional, STIBP disabled, RSB filling, PBRSB-eIBRS Not affected
Vulnerability Srbds:                  Not affected
Vulnerability Tsx async abort:        Not affected
Flags:                                fpu vme de pse tsc msr pae mce cx8 apic sep mtrr pge mca cmov pat pse36 clflush mmx fxsr sse sse2 ht syscall nx mmxext fxsr_opt pdpe1gb rdtscp lm rep_good nopl cpuid extd_apicid tsc_known_freq pni pclmulqdq ssse3 fma cx16 sse4_1 sse4_2 x2apic movbe popcnt aes xsave avx f16c rdrand hypervisor lahf_lm cmp_legacy cr8_legacy abm sse4a misalignsse 3dnowprefetch osvw topoext perfctr_core ssbd ibrs ibpb stibp vmmcall fsgsbase bmi1 avx2 smep bmi2 rdseed adx smap clflushopt clwb sha_ni xsaveopt xsavec xgetbv1 clzero xsaveerptr wbnoinvd arat umip rdpid arch_capabilities
--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:09Z  |  EXIT: 0
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
  TASK  : /proc/cpuinfo (first 200 lines)
  CMD   : bash -c head -n 200 /proc/cpuinfo
  START : 2026-02-27T09:54:09Z
--------------------------------------------------------------------------------
processor	: 0
vendor_id	: AuthenticAMD
cpu family	: 23
model		: 49
model name	: AMD EPYC-Rome Processor
stepping	: 0
microcode	: 0x1000065
cpu MHz		: 2399.998
cache size	: 512 KB
physical id	: 0
siblings	: 4
core id		: 0
cpu cores	: 4
apicid		: 0
initial apicid	: 0
fpu		: yes
fpu_exception	: yes
cpuid level	: 13
wp		: yes
flags		: fpu vme de pse tsc msr pae mce cx8 apic sep mtrr pge mca cmov pat pse36 clflush mmx fxsr sse sse2 ht syscall nx mmxext fxsr_opt pdpe1gb rdtscp lm rep_good nopl cpuid extd_apicid tsc_known_freq pni pclmulqdq ssse3 fma cx16 sse4_1 sse4_2 x2apic movbe popcnt aes xsave avx f16c rdrand hypervisor lahf_lm cmp_legacy cr8_legacy abm sse4a misalignsse 3dnowprefetch osvw topoext perfctr_core ssbd ibrs ibpb stibp vmmcall fsgsbase bmi1 avx2 smep bmi2 rdseed adx smap clflushopt clwb sha_ni xsaveopt xsavec xgetbv1 clzero xsaveerptr wbnoinvd arat umip rdpid arch_capabilities
bugs		: sysret_ss_attrs null_seg spectre_v1 spectre_v2 spec_store_bypass retbleed srso
bogomips	: 4799.99
TLB size	: 1024 4K pages
clflush size	: 64
cache_alignment	: 64
address sizes	: 40 bits physical, 48 bits virtual
power management:

processor	: 1
vendor_id	: AuthenticAMD
cpu family	: 23
model		: 49
model name	: AMD EPYC-Rome Processor
stepping	: 0
microcode	: 0x1000065
cpu MHz		: 2399.998
cache size	: 512 KB
physical id	: 0
siblings	: 4
core id		: 1
cpu cores	: 4
apicid		: 1
initial apicid	: 1
fpu		: yes
fpu_exception	: yes
cpuid level	: 13
wp		: yes
flags		: fpu vme de pse tsc msr pae mce cx8 apic sep mtrr pge mca cmov pat pse36 clflush mmx fxsr sse sse2 ht syscall nx mmxext fxsr_opt pdpe1gb rdtscp lm rep_good nopl cpuid extd_apicid tsc_known_freq pni pclmulqdq ssse3 fma cx16 sse4_1 sse4_2 x2apic movbe popcnt aes xsave avx f16c rdrand hypervisor lahf_lm cmp_legacy cr8_legacy abm sse4a misalignsse 3dnowprefetch osvw topoext perfctr_core ssbd ibrs ibpb stibp vmmcall fsgsbase bmi1 avx2 smep bmi2 rdseed adx smap clflushopt clwb sha_ni xsaveopt xsavec xgetbv1 clzero xsaveerptr wbnoinvd arat umip rdpid arch_capabilities
bugs		: sysret_ss_attrs null_seg spectre_v1 spectre_v2 spec_store_bypass retbleed srso
bogomips	: 4799.99
TLB size	: 1024 4K pages
clflush size	: 64
cache_alignment	: 64
address sizes	: 40 bits physical, 48 bits virtual
power management:

processor	: 2
vendor_id	: AuthenticAMD
cpu family	: 23
model		: 49
model name	: AMD EPYC-Rome Processor
stepping	: 0
microcode	: 0x1000065
cpu MHz		: 2399.998
cache size	: 512 KB
physical id	: 0
siblings	: 4
core id		: 2
cpu cores	: 4
apicid		: 2
initial apicid	: 2
fpu		: yes
fpu_exception	: yes
cpuid level	: 13
wp		: yes
flags		: fpu vme de pse tsc msr pae mce cx8 apic sep mtrr pge mca cmov pat pse36 clflush mmx fxsr sse sse2 ht syscall nx mmxext fxsr_opt pdpe1gb rdtscp lm rep_good nopl cpuid extd_apicid tsc_known_freq pni pclmulqdq ssse3 fma cx16 sse4_1 sse4_2 x2apic movbe popcnt aes xsave avx f16c rdrand hypervisor lahf_lm cmp_legacy cr8_legacy abm sse4a misalignsse 3dnowprefetch osvw topoext perfctr_core ssbd ibrs ibpb stibp vmmcall fsgsbase bmi1 avx2 smep bmi2 rdseed adx smap clflushopt clwb sha_ni xsaveopt xsavec xgetbv1 clzero xsaveerptr wbnoinvd arat umip rdpid arch_capabilities
bugs		: sysret_ss_attrs null_seg spectre_v1 spectre_v2 spec_store_bypass retbleed srso
bogomips	: 4799.99
TLB size	: 1024 4K pages
clflush size	: 64
cache_alignment	: 64
address sizes	: 40 bits physical, 48 bits virtual
power management:

processor	: 3
vendor_id	: AuthenticAMD
cpu family	: 23
model		: 49
model name	: AMD EPYC-Rome Processor
stepping	: 0
microcode	: 0x1000065
cpu MHz		: 2399.998
cache size	: 512 KB
physical id	: 0
siblings	: 4
core id		: 3
cpu cores	: 4
apicid		: 3
initial apicid	: 3
fpu		: yes
fpu_exception	: yes
cpuid level	: 13
wp		: yes
flags		: fpu vme de pse tsc msr pae mce cx8 apic sep mtrr pge mca cmov pat pse36 clflush mmx fxsr sse sse2 ht syscall nx mmxext fxsr_opt pdpe1gb rdtscp lm rep_good nopl cpuid extd_apicid tsc_known_freq pni pclmulqdq ssse3 fma cx16 sse4_1 sse4_2 x2apic movbe popcnt aes xsave avx f16c rdrand hypervisor lahf_lm cmp_legacy cr8_legacy abm sse4a misalignsse 3dnowprefetch osvw topoext perfctr_core ssbd ibrs ibpb stibp vmmcall fsgsbase bmi1 avx2 smep bmi2 rdseed adx smap clflushopt clwb sha_ni xsaveopt xsavec xgetbv1 clzero xsaveerptr wbnoinvd arat umip rdpid arch_capabilities
bugs		: sysret_ss_attrs null_seg spectre_v1 spectre_v2 spec_store_bypass retbleed srso
bogomips	: 4799.99
TLB size	: 1024 4K pages
clflush size	: 64
cache_alignment	: 64
address sizes	: 40 bits physical, 48 bits virtual
power management:

--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:09Z  |  EXIT: 0
--------------------------------------------------------------------------------

================================================================================
  SECTION : 4  MEMORY (RAM)
  TIME    : 2026-02-27T09:54:09Z
================================================================================


--------------------------------------------------------------------------------
  TASK  : free -h
  CMD   : free -h
  START : 2026-02-27T09:54:09Z
--------------------------------------------------------------------------------
               total        used        free      shared  buff/cache   available
Mem:           7.6Gi       2.6Gi       544Mi       5.0Mi       4.4Gi       4.7Gi
Swap:             0B          0B          0B
--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:09Z  |  EXIT: 0
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
  TASK  : DMI – Memory Devices
  CMD   : dmidecode -t memory
  START : 2026-02-27T09:54:09Z
--------------------------------------------------------------------------------
# dmidecode 3.3
Getting SMBIOS data from sysfs.
SMBIOS 2.8 present.

Handle 0x1000, DMI type 16, 23 bytes
Physical Memory Array
	Location: Other
	Use: System Memory
	Error Correction Type: Multi-bit ECC
	Maximum Capacity: 8000 MB
	Error Information Handle: Not Provided
	Number Of Devices: 1

Handle 0x1100, DMI type 17, 40 bytes
Memory Device
	Array Handle: 0x1000
	Error Information Handle: Not Provided
	Total Width: Unknown
	Data Width: Unknown
	Size: 8000 MB
	Form Factor: DIMM
	Set: None
	Locator: DIMM 0
	Bank Locator: Not Specified
	Type: RAM
	Type Detail: Other
	Speed: Unknown
	Manufacturer: QEMU
	Serial Number: Not Specified
	Asset Tag: Not Specified
	Part Number: Not Specified
	Rank: Unknown
	Configured Memory Speed: Unknown
	Minimum Voltage: Unknown
	Maximum Voltage: Unknown
	Configured Voltage: Unknown

--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:09Z  |  EXIT: 0
--------------------------------------------------------------------------------

================================================================================
  SECTION : 5  STORAGE OVERVIEW
  TIME    : 2026-02-27T09:54:09Z
================================================================================


--------------------------------------------------------------------------------
  TASK  : lsblk
  CMD   : lsblk -a -o NAME,TYPE,SIZE,MODEL,SERIAL,TRAN,ROTA,MOUNTPOINT,FSTYPE
  START : 2026-02-27T09:54:09Z
--------------------------------------------------------------------------------
NAME    TYPE  SIZE MODEL         SERIAL   TRAN   ROTA MOUNTPOINT FSTYPE
sda     disk 38.1G QEMU_HARDDISK 29715646           0            
├─sda1  part 37.9G                                  0 /          ext4
├─sda14 part    1M                                  0            
└─sda15 part  244M                                  0 /boot/efi  vfat
sr0     rom  1024M QEMU_DVD-ROM  QM00001  sata      1            
--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:09Z  |  EXIT: 0
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
  TASK  : Block devices – /dev/disk/by-id
  CMD   : bash -c ls -l /dev/disk/by-id 2>/dev/null || true
  START : 2026-02-27T09:54:09Z
--------------------------------------------------------------------------------
total 0
lrwxrwxrwx 1 root root  9 Aug  1  2025 ata-QEMU_DVD-ROM_QM00001 -> ../../sr0
lrwxrwxrwx 1 root root  9 Aug  1  2025 scsi-0QEMU_QEMU_HARDDISK_29715646 -> ../../sda
lrwxrwxrwx 1 root root 10 Aug  1  2025 scsi-0QEMU_QEMU_HARDDISK_29715646-part1 -> ../../sda1
lrwxrwxrwx 1 root root 11 Aug  1  2025 scsi-0QEMU_QEMU_HARDDISK_29715646-part14 -> ../../sda14
lrwxrwxrwx 1 root root 11 Aug  1  2025 scsi-0QEMU_QEMU_HARDDISK_29715646-part15 -> ../../sda15
--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:09Z  |  EXIT: 0
--------------------------------------------------------------------------------

================================================================================
  SECTION : 6  STORAGE DETAILS / HEALTH
  TIME    : 2026-02-27T09:54:09Z
================================================================================


--------------------------------------------------------------------------------
  TASK  : nvme list
  CMD   : nvme list
  START : 2026-02-27T09:54:09Z
--------------------------------------------------------------------------------
Node             SN                   Model                                    Namespace Usage                      Format           FW Rev  
---------------- -------------------- ---------------------------------------- --------- -------------------------- ---------------- --------
--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:09Z  |  EXIT: 0
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
  TASK  : SMART Health – /dev/sda
  CMD   : smartctl -H /dev/sda
  START : 2026-02-27T09:54:09Z
--------------------------------------------------------------------------------
smartctl 7.2 2020-12-30 r5155 [x86_64-linux-5.10.0-32-amd64] (local build)
Copyright (C) 2002-20, Bruce Allen, Christian Franke, www.smartmontools.org

=== START OF READ SMART DATA SECTION ===
SMART Health Status: OK

--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:09Z  |  EXIT: 0
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
  TASK  : SMART Summary – /dev/sda (key attributes)
  CMD   : bash -c  smartctl -a '/dev/sda' | grep -iE 'Model|Serial|Rotation|SATA|SAS|NVMe|User Capacity|Sector Size|Power_On|Temperature|Reallocated|Pending|Offline_Uncorrectable|Overall|SMART Health|Percent_Lifetime_Used|Data Units Written|Media and Data Integrity Errors' || true
  START : 2026-02-27T09:54:09Z
--------------------------------------------------------------------------------
User Capacity:        40,961,572,864 bytes [40.9 GB]
Rotation Rate:        Solid State Device
Current Drive Temperature:     0 C
Drive Trip Temperature:        0 C
--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:09Z  |  EXIT: 0
--------------------------------------------------------------------------------

================================================================================
  SECTION : 7  NETWORK
  TIME    : 2026-02-27T09:54:09Z
================================================================================


--------------------------------------------------------------------------------
  TASK  : ip link (brief)
  CMD   : ip -br link
  START : 2026-02-27T09:54:09Z
--------------------------------------------------------------------------------
lo               UNKNOWN        00:00:00:00:00:00 <LOOPBACK,UP,LOWER_UP> 
eth0             UP             96:00:02:07:cc:05 <BROADCAST,MULTICAST,UP,LOWER_UP> 
wg0              UNKNOWN        <POINTOPOINT,NOARP,UP,LOWER_UP> 
docker0          DOWN           02:42:42:fa:77:fe <NO-CARRIER,BROADCAST,MULTICAST,UP> 
--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:09Z  |  EXIT: 0
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
  TASK  : ip addr (brief)
  CMD   : ip -br addr
  START : 2026-02-27T09:54:09Z
--------------------------------------------------------------------------------
lo               UNKNOWN        127.0.0.1/8 ::1/128 
eth0             UP             157.90.19.91/32 2a01:4f8:1c1e:ab07::1/64 fe80::9400:2ff:fe07:cc05/64 
wg0              UNKNOWN        172.31.255.2/24 
docker0          DOWN           172.17.0.1/16 
--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:09Z  |  EXIT: 0
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
  TASK  : ethtool – docker0
  CMD   : ethtool docker0
  START : 2026-02-27T09:54:09Z
--------------------------------------------------------------------------------
Settings for docker0:
	Supported ports: [  ]
	Supported link modes:   Not reported
	Supported pause frame use: No
	Supports auto-negotiation: No
	Supported FEC modes: Not reported
	Advertised link modes:  Not reported
	Advertised pause frame use: No
	Advertised auto-negotiation: No
	Advertised FEC modes: Not reported
	Speed: Unknown!
	Duplex: Unknown! (255)
	Auto-negotiation: off
	Port: Other
	PHYAD: 0
	Transceiver: internal
	Link detected: no
--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:09Z  |  EXIT: 0
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
  TASK  : ethtool – eth0
  CMD   : ethtool eth0
  START : 2026-02-27T09:54:09Z
--------------------------------------------------------------------------------
Settings for eth0:
	Supported ports: [  ]
	Supported link modes:   Not reported
	Supported pause frame use: No
	Supports auto-negotiation: No
	Supported FEC modes: Not reported
	Advertised link modes:  Not reported
	Advertised pause frame use: No
	Advertised auto-negotiation: No
	Advertised FEC modes: Not reported
	Speed: Unknown!
	Duplex: Unknown! (255)
	Auto-negotiation: off
	Port: Other
	PHYAD: 0
	Transceiver: internal
	Link detected: yes
--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:09Z  |  EXIT: 0
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
  TASK  : ethtool – wg0
  CMD   : ethtool wg0
  START : 2026-02-27T09:54:09Z
--------------------------------------------------------------------------------
No data available
--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:09Z  |  EXIT: 75  [WARN: non-zero exit]
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
  TASK  : PCI – network & storage controllers
  CMD   : bash -c lspci -nn | grep -iE 'ethernet|network|infiniband|raid|sas|sata|nvme|storage' || true
  START : 2026-02-27T09:54:09Z
--------------------------------------------------------------------------------
00:1f.2 SATA controller [0106]: Intel Corporation 82801IR/IO/IH (ICH9R/DO/DH) 6 port SATA Controller [AHCI mode] [8086:2922] (rev 02)
01:00.0 Ethernet controller [0200]: Red Hat, Inc. Virtio network device [1af4:1041] (rev 01)
06:00.0 SCSI storage controller [0100]: Red Hat, Inc. Virtio SCSI [1af4:1048] (rev 01)
--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:09Z  |  EXIT: 0
--------------------------------------------------------------------------------

================================================================================
  SECTION : 8  CEPH
  TIME    : 2026-02-27T09:54:09Z
================================================================================


--------------------------------------------------------------------------------
  TASK  : ceph version
  CMD   : ceph version
  START : 2026-02-27T09:54:09Z
--------------------------------------------------------------------------------
Error initializing cluster client: ObjectNotFound('error calling conf_read_file')
--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:09Z  |  EXIT: 1  [WARN: non-zero exit]
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
  TASK  : ceph -s
  CMD   : ceph -s
  START : 2026-02-27T09:54:09Z
--------------------------------------------------------------------------------
Error initializing cluster client: ObjectNotFound('error calling conf_read_file')
--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:09Z  |  EXIT: 1  [WARN: non-zero exit]
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
  TASK  : ceph osd tree
  CMD   : ceph osd tree
  START : 2026-02-27T09:54:09Z
--------------------------------------------------------------------------------
Error initializing cluster client: ObjectNotFound('error calling conf_read_file')
--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:09Z  |  EXIT: 1  [WARN: non-zero exit]
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
  TASK  : ceph config dump (net params)
  CMD   : bash -c ceph config dump | grep -iE 'public_network|cluster_network|ms_bind' || true
  START : 2026-02-27T09:54:09Z
--------------------------------------------------------------------------------
Error initializing cluster client: ObjectNotFound('error calling conf_read_file')
--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:09Z  |  EXIT: 0
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
  TASK  : ceph osd metadata (OSD 0)
  CMD   : bash -c ceph osd metadata 0 2>/dev/null | head -n 200 || true
  START : 2026-02-27T09:54:09Z
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:10Z  |  EXIT: 0
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
  TASK  : ceph device ls
  CMD   : ceph device ls
  START : 2026-02-27T09:54:10Z
--------------------------------------------------------------------------------
Error initializing cluster client: ObjectNotFound('error calling conf_read_file')
--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:10Z  |  EXIT: 1  [WARN: non-zero exit]
--------------------------------------------------------------------------------

================================================================================
  SECTION : 9  BENCHMARKS
  TIME    : 2026-02-27T09:54:10Z
================================================================================

[NOTE]  Benchmarks can affect system performance. Run during a maintenance window.

--------------------------------------------------------------------------------
  TASK  : sysbench – CPU  (max-prime=20000)
  CMD   : sysbench cpu --cpu-max-prime=20000 run
  START : 2026-02-27T09:54:10Z
--------------------------------------------------------------------------------
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Prime numbers limit: 20000

Initializing worker threads...

Threads started!

CPU speed:
    events per second:  1417.37

General statistics:
    total time:                          10.0003s
    total number of events:              14175

Latency (ms):
         min:                                    0.69
         avg:                                    0.70
         max:                                    1.70
         95th percentile:                        0.73
         sum:                                 9991.95

Threads fairness:
    events (avg/stddev):           14175.0000/0.00
    execution time (avg/stddev):   9.9920/0.00

--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:20Z  |  EXIT: 0
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
  TASK  : sysbench – Memory
  CMD   : sysbench memory run
  START : 2026-02-27T09:54:20Z
--------------------------------------------------------------------------------
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Running memory speed test with the following options:
  block size: 1KiB
  total size: 102400MiB
  operation: write
  scope: global

Initializing worker threads...

Threads started!

Total operations: 56178570 (5617415.03 per second)

54861.88 MiB transferred (5485.76 MiB/sec)


General statistics:
    total time:                          10.0001s
    total number of events:              56178570

Latency (ms):
         min:                                    0.00
         avg:                                    0.00
         max:                                    0.30
         95th percentile:                        0.00
         sum:                                 3871.41

Threads fairness:
    events (avg/stddev):           56178570.0000/0.00
    execution time (avg/stddev):   3.8714/0.00

--------------------------------------------------------------------------------
  END   : 2026-02-27T09:54:30Z  |  EXIT: 0
--------------------------------------------------------------------------------
[NOTE]  FIO writes temporary files under /tmp. Adjust --directory/--size if needed.

--------------------------------------------------------------------------------
  TASK  : fio – sequential write (1 M bs, 2 G, 30 s)
  CMD   : fio --name=seqwrite --rw=write --bs=1M --size=2G --numjobs=1 --runtime=30 --time_based --group_reporting --directory=/tmp
  START : 2026-02-27T09:54:30Z
--------------------------------------------------------------------------------
seqwrite: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
fio-3.25
Starting 1 process
seqwrite: Laying out IO file (1 file / 2048MiB)

seqwrite: (groupid=0, jobs=1): err= 0: pid=3139118: Fri Feb 27 10:55:00 2026
  write: IOPS=1426, BW=1427MiB/s (1496MB/s)(41.8GiB/30001msec); 0 zone resets
    clat (usec): min=310, max=27898, avg=472.41, stdev=688.00
     lat (usec): min=317, max=27906, avg=480.90, stdev=688.21
    clat percentiles (usec):
     |  1.00th=[  326],  5.00th=[  343], 10.00th=[  351], 20.00th=[  367],
     | 30.00th=[  371], 40.00th=[  379], 50.00th=[  392], 60.00th=[  408],
     | 70.00th=[  433], 80.00th=[  486], 90.00th=[  627], 95.00th=[  758],
     | 99.00th=[ 1188], 99.50th=[ 1385], 99.90th=[ 8291], 99.95th=[21365],
     | 99.99th=[26346]
   bw (  MiB/s): min=   18, max= 2342, per=99.28%, avg=1416.67, stdev=664.62, samples=59
   iops        : min=   18, max= 2342, avg=1416.66, stdev=664.62, samples=59
  lat (usec)   : 500=81.61%, 750=13.23%, 1000=3.24%
  lat (msec)   : 2=1.67%, 4=0.06%, 10=0.10%, 20=0.02%, 50=0.07%
  cpu          : usr=1.32%, sys=84.45%, ctx=19563, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,42811,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1427MiB/s (1496MB/s), 1427MiB/s-1427MiB/s (1496MB/s-1496MB/s), io=41.8GiB (44.9GB), run=30001-30001msec

Disk stats (read/write):
  sda: ios=664/94024, merge=0/2804, ticks=354/629205, in_queue=630132, util=72.43%
--------------------------------------------------------------------------------
  END   : 2026-02-27T09:55:00Z  |  EXIT: 0
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
  TASK  : fio – random read/write (4 k bs, 2 G × 4 jobs, 30 s)
  CMD   : fio --name=randrw4k --rw=randrw --bs=4k --size=2G --numjobs=4 --runtime=30 --time_based --group_reporting --directory=/tmp
  START : 2026-02-27T09:55:00Z
--------------------------------------------------------------------------------
randrw4k: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.25
Starting 4 processes
randrw4k: Laying out IO file (1 file / 2048MiB)
randrw4k: Laying out IO file (1 file / 2048MiB)
randrw4k: Laying out IO file (1 file / 2048MiB)
[...]

randrw4k: (groupid=0, jobs=4): err= 0: pid=3139139: Fri Feb 27 10:55:38 2026
  read: IOPS=14.5k, BW=56.7MiB/s (59.4MB/s)(1700MiB/30001msec)
    clat (usec): min=91, max=12480, avg=265.41, stdev=178.27
     lat (usec): min=91, max=12480, avg=265.59, stdev=178.28
    clat percentiles (usec):
     |  1.00th=[  129],  5.00th=[  147], 10.00th=[  159], 20.00th=[  174],
     | 30.00th=[  186], 40.00th=[  194], 50.00th=[  204], 60.00th=[  217],
     | 70.00th=[  231], 80.00th=[  260], 90.00th=[  611], 95.00th=[  676],
     | 99.00th=[  799], 99.50th=[  865], 99.90th=[ 1139], 99.95th=[ 1270],
     | 99.99th=[ 3261]
   bw (  KiB/s): min=24500, max=82104, per=99.59%, avg=57784.63, stdev=5405.84, samples=236
   iops        : min= 6125, max=20526, avg=14445.85, stdev=1351.43, samples=236
  write: IOPS=14.5k, BW=56.7MiB/s (59.5MB/s)(1701MiB/30001msec); 0 zone resets
    clat (nsec): min=1583, max=2269.1k, avg=7078.01, stdev=8238.95
     lat (nsec): min=1633, max=2269.5k, avg=7295.46, stdev=8349.44
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    4],
     | 30.00th=[    5], 40.00th=[    5], 50.00th=[    6], 60.00th=[    7],
     | 70.00th=[    8], 80.00th=[   10], 90.00th=[   13], 95.00th=[   17],
     | 99.00th=[   30], 99.50th=[   39], 99.90th=[   69], 99.95th=[   90],
     | 99.99th=[  151]
   bw (  KiB/s): min=23847, max=83656, per=99.55%, avg=57800.53, stdev=5393.38, samples=236
   iops        : min= 5961, max=20914, avg=14449.85, stdev=1348.32, samples=236
  lat (usec)   : 2=0.07%, 4=13.85%, 10=27.79%, 20=7.02%, 50=1.17%
  lat (usec)   : 100=0.09%, 250=38.81%, 500=4.54%, 750=5.75%, 1000=0.82%
  lat (msec)   : 2=0.08%, 4=0.01%, 10=0.01%, 20=0.01%
  cpu          : usr=2.64%, sys=17.33%, ctx=436111, majf=0, minf=62
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=435172,435477,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=56.7MiB/s (59.4MB/s), 56.7MiB/s-56.7MiB/s (59.4MB/s-59.4MB/s), io=1700MiB (1782MB), run=30001-30001msec
  WRITE: bw=56.7MiB/s (59.5MB/s), 56.7MiB/s-56.7MiB/s (59.5MB/s-59.5MB/s), io=1701MiB (1784MB), run=30001-30001msec

Disk stats (read/write):
  sda: ios=430819/356661, merge=0/711, ticks=101186/225586, in_queue=326848, util=99.75%
--------------------------------------------------------------------------------
  END   : 2026-02-27T09:55:38Z  |  EXIT: 0
--------------------------------------------------------------------------------

================================================================================
  END OF REPORT
  TIME : 2026-02-27T09:55:38Z
================================================================================